bash.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-02-12 Fr 22:35 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Bash Scripts</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="silin" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/bigblow_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/bigblow_theme/css/bigblow.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/bigblow_theme/css/hideshow.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Bash Scripts</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgdb7b2d5">1-Hello Bash Scripting</a></li>
<li><a href="#org4f8c2c6">2-Redirect to file</a></li>
<li><a href="#org16602c6">3-Comments</a></li>
<li><a href="#orgd3301d4">4-Conditional Statements</a></li>
<li><a href="#org1130396">5-Loops</a></li>
<li><a href="#org12dfc72">6-Script input</a></li>
<li><a href="#orgd44d581">7-Script output</a></li>
<li><a href="#org938d707">8-how to send output from one script to another scrpt</a></li>
<li><a href="#orgcebc94e">9-String Processing</a></li>
<li><a href="#orgeb52bcb">10-Numbers and Arithmetic</a></li>
<li><a href="#org3d663b2">11-Declare Command</a></li>
<li><a href="#orga380ab3">12-Arrays</a></li>
<li><a href="#orga849660">13-Functions</a></li>
<li><a href="#org460edd5">14-Files and Directories</a></li>
<li><a href="#org2a1e340">15-Send Email Via Script</a></li>
<li><a href="#orgd087cef">16-Curl in Scripts</a></li>
<li><a href="#org194a4d3">17-Professional Menus</a></li>
<li><a href="#org87d2b13">18-Wait for filesystem events with inotify</a></li>
<li><a href="#orgc0c9a41">19-Introduction to grep</a></li>
<li><a href="#org2b6f3b4">20-Introduction to awk</a></li>
<li><a href="#org627b738">21-Introduction to sed</a></li>
<li><a href="#orgc47fb38">22-Debugging bash scripts</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgdb7b2d5" class="outline-2">
<h2 id="orgdb7b2d5">1-Hello Bash Scripting</h2>
<div class="outline-text-2" id="text-orgdb7b2d5">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #4f97d7;">echo</span> <span style="color: #2d9574;">"nihao, hello world"</span> &gt; ~/Schreibtisch/bashtest.txt
cat ~/Schreibtisch/bashtest.txt
</pre>
</div>

<pre class="example">
nihao, hello world
</pre>
</div>
</div>

<div id="outline-container-org4f8c2c6" class="outline-2">
<h2 id="org4f8c2c6">2-Redirect to file</h2>
<div class="outline-text-2" id="text-org4f8c2c6">
<p>
in emacs shell the context can be given by terminal, ended with enter and  C-d
but in terminal only C-d works
</p>
<div class="org-src-container">
<pre class="src src-sh">cat &gt;&gt; bashtest.txt  
</pre>
</div>
</div>
</div>

<div id="outline-container-org16602c6" class="outline-2">
<h2 id="org16602c6">3-Comments</h2>
<div class="outline-text-2" id="text-org16602c6">
<p>
EOF can be replaced by anything, and the text will be output,
weather is with " " ''
</p>
<div class="org-src-container">
<pre class="src src-sh">cat &lt;&lt; EOF
<span style="color: #2d9574;">    here is what you want </span>
<span style="color: #2d9574;">EOF</span>


</pre>
</div>

<pre class="example">
here is what you want 
</pre>
</div>
</div>

<div id="outline-container-orgd3301d4" class="outline-2">
<h2 id="orgd3301d4">4-Conditional Statements</h2>
<div class="outline-text-2" id="text-orgd3301d4">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #7590db;">count</span>=10

<span style="color: #4f97d7; font-weight: bold;">if</span> [[ $<span style="color: #7590db;">count</span> -eq  10 ]]
<span style="color: #4f97d7; font-weight: bold;">then</span>
     <span style="color: #4f97d7;">echo</span> <span style="color: #2d9574;">"count is 10"</span>
<span style="color: #4f97d7; font-weight: bold;">fi</span>


<span style="color: #4f97d7; font-weight: bold;">if</span> (( $<span style="color: #7590db;">count</span>  &gt;  100 ))
<span style="color: #4f97d7; font-weight: bold;">then</span>
    <span style="color: #4f97d7;">echo</span>  <span style="color: #2d9574;">"22222222222222222222if"</span>
<span style="color: #4f97d7; font-weight: bold;">else</span>
    <span style="color: #4f97d7;">echo</span> <span style="color: #2d9574;">"111111111111111111else"</span>
<span style="color: #4f97d7; font-weight: bold;">fi</span>

</pre>
</div>

<pre class="example">
111111111111111111else
</pre>
</div>
</div>

<div id="outline-container-org1130396" class="outline-2">
<h2 id="org1130396">5-Loops</h2>
<div class="outline-text-2" id="text-org1130396">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #7590db;">count</span>=10
<span style="color: #4f97d7; font-weight: bold;">while</span> [ $<span style="color: #7590db;">count</span> -lt 20 ]
<span style="color: #4f97d7; font-weight: bold;">do</span>
    <span style="color: #4f97d7;">echo</span> <span style="color: #2d9574;">"$count"</span>
    <span style="color: #7590db;">count</span>=$(<span style="color: #bc6ec5;">(count+1</span>))
<span style="color: #4f97d7; font-weight: bold;">done</span>
</pre>
</div>

<pre class="example">
10
11
12
13
14
15
16
17
18
19
</pre>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #4f97d7; font-weight: bold;">for</span> var<span style="color: #4f97d7; font-weight: bold;"> in</span> 1 2 2 2; <span style="color: #4f97d7; font-weight: bold;">do</span>
    <span style="color: #4f97d7;">echo</span> $<span style="color: #7590db;">var</span>
<span style="color: #4f97d7; font-weight: bold;">done</span>
</pre>
</div>

<pre class="example">
1
2
2
2
</pre>


<div class="org-src-container">
<pre class="src src-bash">
<span style="color: #4f97d7; font-weight: bold;">for</span> ((i = 0; i &lt;= 10; i++ ))
<span style="color: #4f97d7; font-weight: bold;">do</span> 
    <span style="color: #4f97d7;">echo</span> $<span style="color: #7590db;">i</span>
<span style="color: #4f97d7; font-weight: bold;">done</span>


</pre>
</div>

<pre class="example">
0
1
2
3
4
5
6
7
8
9
10
</pre>
</div>
</div>

<div id="outline-container-org12dfc72" class="outline-2">
<h2 id="org12dfc72">6-Script input</h2>
<div class="outline-text-2" id="text-org12dfc72">
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #7590db;">args</span>=($<span style="color: #7590db;">@</span>)
<span style="color: #4f97d7;">echo</span> $<span style="color: #7590db;">#</span>

</pre>
</div>

<pre class="example">
0
</pre>


<div class="org-src-container">
<pre class="src src-bash"><span style="color: #4f97d7; font-weight: bold;">while </span><span style="color: #4f97d7;">read</span> line; <span style="color: #4f97d7; font-weight: bold;">do</span>
    <span style="color: #4f97d7;">echo</span> <span style="color: #2d9574;">"$line"</span>
<span style="color: #4f97d7; font-weight: bold;">done</span> &lt; <span style="color: #2d9574;">"${1:-/dev/stdin}"</span>
</pre>
</div>

<pre class="example">
while read line; do
echo "$line"
</pre>
</div>
</div>

<div id="outline-container-orgd44d581" class="outline-2">
<h2 id="orgd44d581">7-Script output</h2>
<div class="outline-text-2" id="text-orgd44d581">
<div class="org-src-container">
<pre class="src src-bash">ls -al 1&gt;~/Schreibtisch/stdoutput.txt 2&gt;~/Schreibtisch/stderroutput.txt
</pre>
</div>

<div class="org-src-container">
<pre class="src src-bash">ls +al &gt;file1.txt 2&gt;&amp;1
</pre>
</div>
</div>
</div>

<div id="outline-container-org938d707" class="outline-2">
<h2 id="org938d707">8-how to send output from one script to another scrpt</h2>
<div class="outline-text-2" id="text-org938d707">
<p>
For secondhello.sh
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #4f97d7;">echo</span> <span style="color: #2d9574;">"the massage is: $MESSAGE"</span>
</pre>
</div>

<pre class="example">
the massage is: 
</pre>



<p>
For hello.sh
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #7590db;">MESSAGE</span>=<span style="color: #2d9574;">"Hello it's me"</span>
<span style="color: #4f97d7;">export</span> MESSAGE
./secondHello.sh
</pre>
</div>

<p>
execute hello.sh
</p>
</div>
</div>

<div id="outline-container-orgcebc94e" class="outline-2">
<h2 id="orgcebc94e">9-String Processing</h2>
<div class="outline-text-2" id="text-orgcebc94e">
<p>
^ first later Capital
^^ all Capital
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #7590db;">str1</span>=<span style="color: #2d9574;">"niaho"</span>
<span style="color: #4f97d7;">echo</span> ${<span style="color: #7590db;">str1</span>^}
<span style="color: #4f97d7;">echo</span> ${<span style="color: #7590db;">str1</span>^^}
</pre>
</div>

<pre class="example">
Niaho
NIAHO
</pre>
</div>
</div>

<div id="outline-container-orgeb52bcb" class="outline-2">
<h2 id="orgeb52bcb">10-Numbers and Arithmetic</h2>
<div class="outline-text-2" id="text-orgeb52bcb">
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #7590db;">a</span>=10
<span style="color: #7590db;">b</span>=20
<span style="color: #4f97d7;">echo</span>  $(<span style="color: #bc6ec5;">( a+b </span>))
<span style="color: #4f97d7;">echo</span>  $(<span style="color: #bc6ec5;">( a-b </span>))
<span style="color: #4f97d7;">echo</span>  $(<span style="color: #bc6ec5;">( a*b </span>))
<span style="color: #4f97d7;">echo</span>  $(<span style="color: #bc6ec5;">( a/b </span>))
<span style="color: #4f97d7;">echo</span>  $(<span style="color: #bc6ec5;">( a%b </span>))

<span style="color: #4f97d7;">echo</span> $(<span style="color: #bc6ec5;">expr $a + $b </span>)
<span style="color: #4f97d7;">echo</span> $(<span style="color: #bc6ec5;">expr $a - $b </span>)
<span style="color: #4f97d7;">echo</span> $(<span style="color: #bc6ec5;">expr $a \* $b </span>)
<span style="color: #4f97d7;">echo</span> $(<span style="color: #bc6ec5;">expr $a / $b </span>)
<span style="color: #4f97d7;">echo</span> $(<span style="color: #bc6ec5;">expr $a % $b </span>)

</pre>
</div>

<pre class="example">
30
-10
200
0
10
30
-10
200
0
10
</pre>
</div>
</div>

<div id="outline-container-org3d663b2" class="outline-2">
<h2 id="org3d663b2">11-Declare Command</h2>
<div class="outline-text-2" id="text-org3d663b2">
<p>
-r readonly, can't be changed
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #4f97d7;">declare</span> -r <span style="color: #7590db;">pwdfilee</span>=/etc/apm
<span style="color: #4f97d7;">echo</span> $<span style="color: #7590db;">pwdfilee</span> 
</pre>
</div>

<pre class="example">
/etc/apm
</pre>
</div>
</div>

<div id="outline-container-orga380ab3" class="outline-2">
<h2 id="orga380ab3">12-Arrays</h2>
<div class="outline-text-2" id="text-orga380ab3">
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #7590db;">car</span>=(<span style="color: #2d9574;">'BMW'</span> <span style="color: #2d9574;">'TOYOTA'</span> <span style="color: #2d9574;">'BILI'</span>)
<span style="color: #4f97d7;">echo</span> <span style="color: #2d9574;">"${car[@]}"</span>
<span style="color: #4f97d7;">echo</span> <span style="color: #2d9574;">"${car[1]}"</span>
<span style="color: #4f97d7;">unset</span> car[1]
<span style="color: #4f97d7;">echo</span> <span style="color: #2d9574;">"${car[@]}"</span>
<span style="color: #4f97d7;">echo</span> ${#<span style="color: #7590db;">car</span>[@]}
<span style="color: #7590db;">car</span>[2]=<span style="color: #2d9574;">'ROVER'</span>
<span style="color: #4f97d7;">echo</span> <span style="color: #2d9574;">"${car[@]}"</span>
<span style="color: #4f97d7;">echo</span> ${#<span style="color: #7590db;">car</span>[@]}
</pre>
</div>

<pre class="example">
BMW TOYOTA BILI
TOYOTA
BMW BILI
2
BMW ROVER
2
</pre>
</div>
</div>

<div id="outline-container-orga849660" class="outline-2">
<h2 id="orga849660">13-Functions</h2>
<div class="outline-text-2" id="text-orga849660">
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #4f97d7; font-weight: bold;">function</span> <span style="color: #bc6ec5; font-weight: bold;">printhowisthename</span>()
{
    <span style="color: #4f97d7;">echo</span> $<span style="color: #7590db;">1</span>
}
printhowisthename lining
</pre>
</div>

<pre class="example">
lining
</pre>


<div class="org-src-container">
<pre class="src src-bash"><span style="color: #4f97d7; font-weight: bold;">function</span> <span style="color: #bc6ec5; font-weight: bold;">localfunktion</span>(){
    <span style="color: #7590db;">returevalue</span>=<span style="color: #2d9574;">"localfunktion"</span>
}
<span style="color: #7590db;">returevalue</span>=<span style="color: #2d9574;">"globalfunktion"</span>
<span style="color: #4f97d7;">echo</span> $<span style="color: #7590db;">returevalue</span>

localfunktion
<span style="color: #4f97d7;">echo</span> $<span style="color: #7590db;">returevalue</span>

</pre>
</div>

<pre class="example">
globalfunktion
localfunktion
</pre>
</div>
</div>

<div id="outline-container-org460edd5" class="outline-2">
<h2 id="org460edd5">14-Files and Directories</h2>
<div class="outline-text-2" id="text-org460edd5">
<div class="org-src-container">
<pre class="src src-bash">


</pre>
</div>
</div>
</div>

<div id="outline-container-org2a1e340" class="outline-2">
<h2 id="org2a1e340">15-Send Email Via Script</h2>
<div class="outline-text-2" id="text-org2a1e340">
<div class="org-src-container">
<pre class="src src-bash">
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd087cef" class="outline-2">
<h2 id="orgd087cef">16-Curl in Scripts</h2>
<div class="outline-text-2" id="text-orgd087cef">
<div class="org-src-container">
<pre class="src src-bash">
</pre>
</div>
</div>
</div>

<div id="outline-container-org194a4d3" class="outline-2">
<h2 id="org194a4d3">17-Professional Menus</h2>
<div class="outline-text-2" id="text-org194a4d3">
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">! /bin/</span><span style="color: #4f97d7; font-weight: bold;">bash</span>
<span style="color: #4f97d7; font-weight: bold;">select</span> car<span style="color: #4f97d7; font-weight: bold;"> in</span> BMW ROVER AUDI BENLI
<span style="color: #4f97d7; font-weight: bold;">do</span>
    <span style="color: #4f97d7; font-weight: bold;">case</span> $<span style="color: #7590db;">car</span><span style="color: #4f97d7; font-weight: bold;"> in</span>
        BMW)
            <span style="color: #4f97d7;">echo</span> <span style="color: #2d9574;">"BMW SELECTED"</span>;;
        ROVER)
            <span style="color: #4f97d7;">echo</span> <span style="color: #2d9574;">"ROVER SELECTED"</span>;;
        AUDI)
            <span style="color: #4f97d7;">echo</span> <span style="color: #2d9574;">"AUDI SELECTED"</span>;;
        BENLI)
            <span style="color: #4f97d7;">echo</span> <span style="color: #2d9574;">"BENLI SELECTED"</span>;;
        *)
            <span style="color: #4f97d7;">echo</span> <span style="color: #2d9574;">"ERROR! please only give number 0 to 4"</span>;;
        <span style="color: #4f97d7; font-weight: bold;">esac</span>
<span style="color: #4f97d7; font-weight: bold;">done</span>

</pre>
</div>
</div>
</div>

<div id="outline-container-org87d2b13" class="outline-2">
<h2 id="org87d2b13">18-Wait for filesystem events with inotify</h2>
<div class="outline-text-2" id="text-org87d2b13">
<div class="org-src-container">
<pre class="src src-bash">
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc0c9a41" class="outline-2">
<h2 id="orgc0c9a41">19-Introduction to grep</h2>
<div class="outline-text-2" id="text-orgc0c9a41">
<div class="org-src-container">
<pre class="src src-bash">
</pre>
</div>
</div>
</div>

<div id="outline-container-org2b6f3b4" class="outline-2">
<h2 id="org2b6f3b4">20-Introduction to awk</h2>
<div class="outline-text-2" id="text-org2b6f3b4">
<div class="org-src-container">
<pre class="src src-bash">
</pre>
</div>
</div>
</div>

<div id="outline-container-org627b738" class="outline-2">
<h2 id="org627b738">21-Introduction to sed</h2>
<div class="outline-text-2" id="text-org627b738">
<div class="org-src-container">
<pre class="src src-bash">
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc47fb38" class="outline-2">
<h2 id="orgc47fb38">22-Debugging bash scripts</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: silin</p>
<p class="date">Created: 2021-02-12 Fr 22:35</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
